app/views/games/game.html.haml

%ul.player_list
  - @game.players.each do |player|
---
SELECT "players".* FROM "players" WHERE "players"."game_id" = $1 ORDER BY id  [["game_id", 14]]