app/views/games/lobby.html.haml

%table.table.table-hover.table-striped.table-bordered.lobby_table
  - @game.players.each do |player|
---
SELECT "players".* FROM "players" WHERE "players"."game_id" = ?  [["game_id", 11]]