app/controllers/games_controller.rb

INSERT INTO "games" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Tue, 09 Jul 2013 21:35:42 UTC +00:00], ["name", "hello"], ["updated_at", Tue, 09 Jul 2013 21:35:42 UTC +00:00]]
INSERT INTO "players" ("auth_hash", "created_at", "game_id", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["auth_hash", "a3ff2a2c-58cf-4734-b4a7-695f1d9a314b"], ["created_at", Tue, 09 Jul 2013 21:35:42 UTC +00:00], ["game_id", 1], ["name", "hello"], ["updated_at", Tue, 09 Jul 2013 21:35:42 UTC +00:00]]
SELECT 1 AS one FROM "games" WHERE "games"."name" = 'Geeeele' LIMIT 1
SELECT 1 AS one FROM "players" WHERE "players"."auth_hash" = '8d85680b-a322-453e-ac34-eded3478b3fe' LIMIT 1
---
  def create
    game = Game.create!( :name => params[:game_name] )
    session[:auth] = SecureRandom.uuid
    player = Player.create!( :game => game, :name => params[:player_name].present? ? params[:player_name] : "Player1", :auth_hash => session[:auth] )

SELECT "games".* FROM "games" WHERE "games"."name" = 'TestGame2' LIMIT 1
INSERT INTO "players" ("auth_hash", "created_at", "game_id", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["auth_hash", "a3250b49-e805-4ac6-bf41-8d3a54e69981"], ["created_at", Tue, 09 Jul 2013 23:04:12 UTC +00:00], ["game_id", 2], ["name", "brob"], ["updated_at", Tue, 09 Jul 2013 23:04:12 UTC +00:00]]
SELECT 1 AS one FROM "players" WHERE "players"."auth_hash" = '744c9b64-892c-4cc8-b3f0-562f17754c8c' LIMIT 1
---
  def join
    game = Game.find_by_name( params[:game_name] )
    raise "No game found by the name of '#{params[:game_name]}'" if game.nil?

    if game.is_active?
      if current_player.try( :game_id ) != game.id
        raise "This game is already in session"
      else
        redirect_to :action => "game", :id => game.id
        return
      end
    end
    session[:auth] = SecureRandom.uuid
    player = Player.create!( :game => game, :name => params[:player_name].present? ? params[:player_name] : "Player#{game.players.count + 1}", :auth_hash => session[:auth] )

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT 1  [["id", "9"]]
SELECT "players".* FROM "players" WHERE "players"."auth_hash" = 'f2d1af43-4cc1-4384-947f-50d49ca574f1' LIMIT 1
---
  def lobby
    raise "You don't belong here!" unless params[:id].present? && session[:auth].present?
    @game = Game.find( params[:id] )
    @player = Player.find_by_auth_hash( session[:auth] )

SELECT "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", "4"]]
SELECT "players".* FROM "players" WHERE "players"."game_id" = $1 ORDER BY id  [["game_id", 14]]
SELECT "players"."auth_hash" FROM "players" WHERE "players"."game_id" = $1 ORDER BY id  [["game_id", 14]]
---
  def game
    begin
      @game = Game.find( params[:id] )
    rescue
      redirect_to :action => 'index'
      return
    end

    @players = @game.players.order("id")

    if !@game.is_active? && !@game.is_over?
      redirect_to :action => "lobby", :id => @game.id
      return
    end

    raise "You aren't in this game!" unless @players.pluck( :auth_hash ).include? session[:auth]