app/controllers/players_controller.rb

  def ready
    player = Player.find_by_auth_hash( session[:auth] )
    player.update_attributes!( :is_ready => !player.is_ready )

    js_res = "
      var player_rdy = $( player_#{player.id}_ready );
      player_rdy.html( '#{player.is_ready? ? "Ready" : "Not Ready" }' );

      if( player_rdy.is( 'a' ) ) player_rdy.swapClass( 'btn-success', 'btn-danger' );
      else if( player_rdy.is( '.label' ) ) player_rdy.swapClass( 'label-success', 'label-important' );
    "
    PrivatePub.publish_to "/lobby/#{player.game_id}", js_res

    game = player.game
    players = game.players
    unless players.size <= 1 || players.pluck( :is_ready ).include?( false )

      # setup loyalties
      game.update_attributes!( :is_active => true );

      spies = players.sample( Game::SPY_NUMBERS[players.size.to_s] )

      spies.each do |spy|
        spy.update_attributes!( :loyalty => 1 )
      end

      players.each do |player|
        player.update_attributes!( :loyalty => 0 ) unless spies.include? player
---
SELECT "players".* FROM "players" WHERE "players"."auth_hash" = 'd5fb658a-5836-4753-a222-0e95a806068b' LIMIT 1
UPDATE "players" SET "is_ready" = ?, "updated_at" = ? WHERE "players"."id" = 11  [["is_ready", true], ["updated_at", Sun, 07 Jul 2013 23:02:49 UTC +00:00]]
SELECT "players"."is_ready" FROM "players" WHERE "players"."game_id" = ?  [["game_id", 20]]
SELECT COUNT(*) FROM "players" WHERE "players"."game_id" = $1  [["game_id", 11]]
UPDATE "games" SET "is_active" = $1, "updated_at" = $2 WHERE "games"."id" = 9  [["is_active", true], ["updated_at", Wed, 10 Jul 2013 00:00:50 UTC +00:00]]
SELECT "players".* FROM "players" WHERE "players"."game_id" = $1  [["game_id", 18]]
SELECT 1 AS one FROM "players" WHERE ("players"."auth_hash" = 'd5fb658a-5836-4753-a222-0e95a806068b' AND "players"."id" != 11) LIMIT 1

  def change_name
    player = Player.find_by_auth_hash( session[:auth] )
    player.update_attributes!( :name => params[:player_name] )
---
SELECT "players".* FROM "players" WHERE "players"."auth_hash" = '36ae145d-c018-4279-a2cb-603de01eac14' LIMIT 1
UPDATE "players" SET "name" = ?, "updated_at" = ? WHERE "players"."id" = 33  [["name", "gorp"], ["updated_at", Tue, 09 Jul 2013 16:21:50 UTC +00:00]]